const postsData = [
    {
        id: 0,
        date: {
            year: 2023,
            month: 6,
            day: 20
        },
        name: 'Музыка - это искусство',
        text: '<span>Музыка</span> - это искусство, которое способно передавать самые разные эмоции и настроения. <span>Музыка</span> может вдохновлять, успокаивать, радовать, грустить, возмущать, удивлять и многое другое. <span>Музыка</span> - это язык, который понятен всем, независимо от национальности, возраста или образования.',
        allText: '<span>Музыка</span> - это искусство, которое способно передавать самые разные эмоции и настроения. <span>Музыка</span> может вдохновлять, успокаивать, радовать, грустить, возмущать, удивлять и многое другое. <span>Музыка</span> - это язык, который понятен всем, независимо от национальности, возраста или образования. <span>Музыка</span> - это магия, которая объединяет людей и делает их жизнь богаче и интереснее.',
        comments: [
            {
                name: 'Иван Будько',
                text: 'Музыка, это круто!'
            },
            {
                name: 'Александ Петров',
                text: 'Музыка сопровождает меня всегда...'
            }
        ]
    },
    {
        id: 1,
        date: {
            year: 2023,
            month: 6,
            day: 24
        },
        name: 'Нейроные сети теперь пишут музыку!',
        text: '<span>Песня</span> - это не только музыка, но и слова, которые должны быть созвучны, ритмичны и смысловы. Написать хорошую песню - это искусство, которое требует таланта и мастерства. Но можно ли <span>научить машину</span> создавать песни? И какие технологии и алгоритмы используются для этого?',
        allText: '<span>Песня</span> - это не только музыка, но и слова, которые должны быть созвучны, ритмичны и смысловы. Написать хорошую песню - это искусство, которое требует таланта и мастерства. Но можно ли <span>научить машину</span> создавать песни? И какие технологии и алгоритмы используются для этого?</br><span>Нейросетевая</span> генерация песен - это процесс создания песен при помощи <span>нейронных сетей</span>, которые <span>обучаются</span> на больших коллекциях песен разных жанров и стилей и <span>генерируют</span> новые на их основе. <span>Нейросети</span> могут работать как с текстом, так и с музыкой, а также комбинировать их в единое целое. <span>Нейросети</span> могут также помогать человеческим авторам, предлагая им идеи, варианты или дополнения.',
        comments: [
            {
                name: 'Илон Маск',
                text: 'Уго!'
            }
        ]
    },
]